---
kind: method
id: M:Autodesk.Revit.DB.FillPattern.GetFillGrid(System.Int32)
source: html/71be2141-457a-b6ce-9c67-ce7b21097316.htm
---
# Autodesk.Revit.DB.FillPattern.GetFillGrid Method

Gets the specified fill grid.

## Syntax (C#)
```csharp
public FillGrid GetFillGrid(
	int gridIdx
)
```

## Parameters
- **gridIdx** (`System.Int32`) - The index of the fill grid.

## Returns
The fill grid.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - The index of the FillGrid is not valid.